package cmd
//定义不同尺寸设备对应需要点击按钮的坐标 后面可以使用ini配置
var PointerMap = map[string]map[string][]int{
	"1080x1920":{
		"swipe0":[]int{459, 715, 454, 273, 500},//滑动关卡
		"tap1_3":[]int{476, 567},//先点其它的切换一下
		"tap1_0":[]int{627, 426},//选择开始关卡信息
		"tap1_1":[]int{1470, 663},//点击大师难度
		"tap1_2":[]int{1497, 908},//点击下一步
		"tap2":[]int{1491, 876},//开始闯关按钮
		"tap3":[]int{1520, 978},//点击对话框和再次挑战同一个地方
		"index_wan":[]int{1489,793},//首页万象天工
		"wan_swipe":[]int{1414,640,415,656,500},//滑动关卡到万象天工
		"to_risk":[]int{961, 808},//冒险列表挑战
		"rect_area1":[]int{1280,840},//图片对比选取区域 提升对比速度
	},
}
